Revit 2027 API
BuiltInFailures.PathFailures.Path3dRegenError Property
 Picked Path could not be regenerated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId Path3dRegenError { get; }
Public Shared ReadOnly Property Path3dRegenError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ Path3dRegenError {
	FailureDefinitionId^ get ();
}
static member Path3dRegenError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PathFailures Class
Autodesk.Revit.DB Namespace